04_Simulation/BSL_RANS_k_Omega_SST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 6.1e-06; // nut=k/omega

boundaryField
{

    bott
    {
        type          nutkWallFunction; // fixedValue;
        value         uniform 1e-12;
    }
    leftSide
    {
        type          nutkWallFunction; // fixedValue;
        value         uniform 1e-12;
    }
    inlet
    {
        type          calculated;
        value         uniform 0;
    }
    outlet
    {
        type          zeroGradient;
    }
    top
    {
        type          nutkWallFunction; // fixedValue;
        value         uniform 1e-12;
    }
    rightSide
    {
        type          nutkWallFunction; // fixedValue;
        value         uniform 1e-12;
    }

}

// ************************************************************************* //
