04_Simulation/BSL_RANS_k_Omega_SST/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

/**
    Patch order

    auto0 wall 
    auto1 back 
    auto2 front 
    auto3 inlet 
    auto4 top_BC
    auto5 outlet 
    auto6 wall 
    auto7 wall 
*/

patches (
    {
        // Name of new patch
        name bott;

        // Dictionary to construct new patch from
        patchInfo {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = set : name of faceSet
        patches (auto0);
    }

    {
        name leftSide;
        patchInfo {
            type wall;
        }
        constructFrom patches;
        patches (auto1);
    }

    {
        name inlet;
        patchInfo {
            type patch;
        }
        constructFrom patches;
        patches (auto2);
    }

    {
        name outlet;
        patchInfo {
            type patch;
        }
        constructFrom patches;
        patches (auto3);
    }

    {
        name top;
        patchInfo {
            type wall;
        }
        constructFrom patches;
        patches (auto4);
    }

    {
        name rightSide;
        patchInfo {
            type wall;
        }
        constructFrom patches;
        patches (auto5);
    }

);

// ************************************************************************* //
