04_Simulation/BSL_RANS_k_Omega_SST/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 480; //480; //96; //24;

method          scotch;

simpleCoeffs {
    n               ( 24 1 1 );
    delta           0.001;
}

hierarchicalCoeffs {
    n               ( 2 1 1 );
    delta           0.001;
    order           xyz;
}

metisCoeffs {
}

manualCoeffs {
    dataFile        "";
}

distributed     no;

roots           ( );

// ************************************************************************* //
