04_Simulation/BSL_RANS_k_Omega_SST/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    /** RANS */
    p
    {
        solver          GAMG;
        tolerance       1e-06; //1e-05; // 1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 6000; //2000; // sqrt(nCells) is a good number
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.001; //0.01; //0.001;
    }

    "(epsilon|omega|nuTilda|zeta)"
    {
        $U;
        tolerance       1e-10; //1e-09; //1e-10;
        relTol          0.01;
    }

    "(U|epsilon|omega|nuTilda)Final"
    {
        $U;
        relTol          0;
    }

    k
    {
        $U;
        tolerance       1e-7;
        relTol          0.01;
    }

    kFinal
    {
        $U;
        relTol          0;
    }


}

SIMPLE
{
    nNonOrthogonalCorrectors 0; //1
    pRefCell 0;
    pRefValue 0;

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors 1;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    fields
    {
        p              0.3; // 0.3;
    }
    equations
    {
        U              0.7; // 0.7;
        k              0.7; // 0.7;
        omega          0.7; // 0.7;
    }
}
