04_Simulation/BSL_RANS_k_Omega_SST/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;//false;//true;
addLayers       true; //false;//true;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{

BeVERLI_3D_Hill_VT_STL_mm.stl
    {
        type triSurfaceMesh;
        name BeVERLI_3D_Hill;
 patchInfo
            {
                type wall;
            }
    }


inlet.stl
    {
        type triSurfaceMesh;
        name inlet;
 patchInfo
            {
                type patch;
            }
    }

outlet.stl
    {
        type triSurfaceMesh;
        name outlet;
 patchInfo
            {
                type patch;
            }
    }

top.stl
    {
        type triSurfaceMesh;
        name top;
 patchInfo
            {
                type patch;
            }
    }
/*
bottom_cut.stl
    {
        type triSurfaceMesh;
        name bottom;
 patchInfo
            {
                type wall;
            }
    }

right_side.stl
    {
        type triSurfaceMesh;
        name right_side;
 patchInfo
            {
                type wall;
            }
    }

left_side.stl
    {
        type triSurfaceMesh;
        name left_side;
 patchInfo
            {
                type wall;
            }
    }
*/
Resolved_walls.stl
    {
        type triSurfaceMesh;
        name Resolved_walls;
 patchInfo
            {
                type wall;
            }
    }



 
    refinementBox1 // level 1
    {
        type searchableBox;
        min (-1200 0 -900 );  //  
        max (2000 800 900 ); //

    } 


    refinementBox2 // level 3
    {
        type searchableBox;
        min (-700.0 0.0 -700.0 );  //  
        max ( 1400.0 600.0 700.0); //  
    } 


    refinementBox3 // level 3
    {
        type searchableBox;
        min (1350 0.0 -700.0 );  //  
        max ( 2000.0 350.0 700.0); //  
    }


  
  refinementBox4 // level 4
    {
        type searchableBox;
        min (-6600 0.0 -920.0 );  //  
        max ( 2500 24 -896); //  
    }


    refinementBox5 // level 4
    {
        type searchableBox;
        min (-6600 0.0 896.0 );  // * 
        max ( 2500 24 920); //  

    }



 /* cylinder
    {
  type searchableCylinder;
  point1 (0 0.0 -0.040);
  point2 (0 0.0 0.152);
  radius 0.250;
    } */


};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 2000000000; //100000

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 2000000000; //2000000

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 10;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
  maxLoadUnbalance 0.10;


    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 3; //6 3



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "BeVERLI_3D_Hill_VT_STL_mm.eMesh";
           level 4; //3;  // levels ((0.0 0)); //level 3
        }
        {
            file "Resolved_walls.eMesh";
           level 3; //3;  // levels ((0.0 0)); //level 3
        }
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        BeVERLI_3D_Hill
        {
            // Surface-wise min and max refinement level
            level (4 4); // level (3 3); 

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
          //  patchInfo
           // {
           //     type wall;
            //    inGroups (motorBikeGroup);
            //}
        }

      

       /* cylinder
        {
            level (4 4);
        } */


inlet
    {
level (0 0); 
    }

outlet
    {
level (0 0); 
    }

top
    {
level (0 0); 
    }

/*
bottom
    {
level (3 3); 
    }

right_side
    {
level (3 3); 
    }

left_side
    {
level (3 3); 
    }
*/

Resolved_walls
    {
level (3 3); 
    }



    }

    // Resolve sharp angles
    resolveFeatureAngle 30; //30


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {

       refinementBox1
        {
            mode inside;
            levels ((1E15 1)); // levels ((1E15 4));
        } 

       refinementBox2
        {
            mode inside;
            levels ((1E15 3)); // levels ((1E15 4));
        } 

       refinementBox3
        {
            mode inside;
            levels ((1E15 3)); // levels ((1E15 4));
        } 


       refinementBox4
        {
            mode inside;
            levels ((1E15 4)); // levels ((1E15 4));
        } 

       refinementBox5
        {
            mode inside;
            levels ((1E15 4)); // levels ((1E15 4));
        } 


	/*cylinder
        {
            mode  distance;
            levels ((0.070 4)); //0.02 is the distance measured as we move away from the cylinder surface
        } */

    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (3000.0002 1600.000 800.00005); // should lie outside stl geometry but inside the domain 


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces false; //true
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 3;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 2.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 10; //30

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 5; //10

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
      meshShrinker        displacementMedialAxis;
   solver              displacementLaplacian;
  displacementLaplacianCoeffs
  //  {
    //    //- Increase diffusivity close to all walls
    //    //diffusivity         quadratic inverseDistance 1(WHEEL);
        diffusivity         uniform;
  //  }
    //layerTerminationAngle -180;
    detectExtrusionIsland true;

     // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes false; //true
    firstLayerThickness 0.025; 

    // Per final patch (so not geometry!) the layer information
    layers
    {
        BeVERLI_3D_Hill //"(insulated_object|heated_surf).*"
        {
           // nSurfaceLayers 19; //20 
           thickness 33.0; //23.06;
            nSurfaceLayers 26; //19;
            expansionRatio 1.25; //1.35;
            firstLayerThickness 0.025;
        }
/*
       bottom //"(insulated_object|heated_surf).*"
        {
            nSurfaceLayers 17; //20
        }
       "(right_side|left_side).*" //"(insulated_object|heated_surf).*"
        {
            nSurfaceLayers 17; //22
        }
*/

       Resolved_walls //"(insulated_object|heated_surf).*"
        {
           // nSurfaceLayers 19; //20
           thickness 33.0; //23.06;
            nSurfaceLayers 26; //19;
            expansionRatio 1.25; //1.35;
            firstLayerThickness 0.025;
        }
    }

    // Expansion factor for layer mesh
    nSurfaceLayers 0;
    // Expansion factor for layer mesh
    expansionRatio 1.25; //1.35

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
   // finalLayerThickness 0.7407; //0.77 0.66667 0.83333
   // firstLayerThickness 0.01; //0.2

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    minThickness 0.000002; //0.15

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;

    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 110;// 110, 180,60;

    // Merge the faces when the angle between them is smaller; default value
    // is of featureAngle, set to lower value if featureAngle is set to
    // larger values (over 100)
    mergePatchFacesAngle    45;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    slipFeatureAngle 30; //80,30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;//10;//5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 2;//5;//2;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 4;//8;//4;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;//20;//10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;//0.7;//0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
    minMedianAxisAngle 90;


    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 70;//50;
}


// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- amount to scale back displacement at error points
    errorReduction 0.75;
//minTetQuality   -1e30;
maxNonOrtho     90;
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
